
import Contact from "@/components/Contact";
import { Metadata } from "next";
export const metadata: Metadata = {
  title: "اتصل بنا - Al-Basher Shop",
  keywords: [
    "اتصل بنا",
    "الدعم الفني",
    "استفسارات العملاء",
    "خدمة العملاء",
    "متجر البشير شوب",
    "Al-Basher Shop",
    "Albasher Shop",
    "Al-Basher iPhone Store",
    "تواصل معنا",
    "مساعدة العملاء",
    "استفسارات",
    "الدعم الفني للهواتف",
    "الدعم الفني للآيفون",
    "الدعم الفني للإكسسوارات",
    "الدعم الفني للمنتجات",
    "الدعم الفني للمتجر",
    "الدعم الفني في إربد",
    "الدعم الفني في الأردن",
    "الدعم الفني للمنتجات الأصلية",
    "الدعم الفني للماركات",
    "الدعم الفني للعلامات التجارية",
    "الدعم الفني للمنتجات الإلكترونية",
    "الدعم الفني للهواتف الذكية",
    "الدعم الفني للآيباد",
    "الدعم الفني للساعة الذكية",
    "الدعم الفني للملحقات",
    "الدعم الفني للبطاريات",
    "الدعم الفني للشواحن",
    "الدعم الفني للكابلات",
    
  ],
  openGraph: {
    title: "اتصل بنا - Al-Basher Shop",
    description: "تواصل معنا لأي استفسارات أو دعم فني. نحن هنا لمساعدتك في كل ما تحتاجه من متجر البشير شوب.",
    url: "https://albasheershop.com/contact",
    siteName: "Al-Basher Shop",
    images: [
      {
        url: "https://albasher.shop/images/og-image.jpg",
        width: 1200,
        height: 630,
        alt: "اتصل بنا - Al-Basher Shop",
      },
    ],
  },
  description:
    "أفضل متجر في إربد لبيع أجهزة iPhone الأصلية، اكسسوارات الهواتف، ساعات آبل، شواحن أصلية، وصلات شحن، ملحقات آيباد، منتجات جيروم، أنكر، جوجل وغيرها من أفضل العلامات التجارية. تسوق الآن مع توصيل سريع وخدمة مميزة في الأردن.",

};

const ContactPage = () => {
  return (
    <Contact/>
  );
};

export default ContactPage;
