import React from "react";
import Product from "@/components/Products";

import { Metadata } from "next";
export const metadata: Metadata = {
  title: "Al-Basher Shop - المنتجات",
  keywords: [
    "منتجات",
    "تسوق عبر الإنترنت",
    "أجهزة iPhone",
    "اكسسوارات الهواتف",
    "ساعات آبل",
    "شواحن أصلية",
    "وصلات شحن",
    "ملحقات آيباد",
    "منتجات أصلية",
    "توصيل سريع",
    "أحدث المنتجات",
    "أجهزة إلكترونية جديدة",
    "أحدث الإكسسوارات",
    "أحدث الساعات الذكية",
    "أحدث الشواحن",
    "أحدث وصلات الشحن",
    "أحدث ملحقات آيباد",
    "أحدث سماعات بلوتوث",
    "أحدث بطاريات متنقلة",
    "أحدث حماية شاشة آيفون",
    "أحدث كفرات آيفون",
    "أحدث سماعات AirPods",
    "أحدث قلم آبل",
    "أحدث ملحقات أبل",
    "أحدث منتجات جيروم",
    "أحدث منتجات أنكر",
    "أحدث منتجات جوجل",
    "أحدث منتجات سامسونج",
    "أحدث منتجات سوني",
    "أحدث منتجات هواوي",
    "أحدث منتجات شاومي",
    "أحدث منتجات أوبو",
    "أحدث منتجات ون بلس",
    "أحدث منتجات ريلمي",
    "أحدث منتجات موتورولا",
    "أحدث منتجات إل جي",
    "أحدث منتجات نوكيا",
    "احدث منتجات ابل",
    "احدث منتجات آيفون",
    "احدث منتجات آيباد",
    "ايباد",
    "ابل ووتش",
    "ايفون",
    "اكسسوارات آيفون",
    "اكسسوارات آيباد",
    "ايفون الأردن",
    "اكسسوارات أصلية",
    "اكسسوارات آبل ووتش",
  ],
  description:
    "أفضل متجر في إربد لبيع أجهزة iPhone الأصلية، اكسسوارات الهواتف، ساعات آبل، شواحن أصلية، وصلات شحن، ملحقات آيباد، منتجات جيروم، أنكر، جوجل وغيرها من أفضل العلامات التجارية. تسوق الآن مع توصيل سريع وخدمة مميزة في الأردن.",
};
const ShopWithSidebarPage = () => {
  return (
    <main>
      <Product />
    </main>
  );
};

export default ShopWithSidebarPage;
