import React from "react";

import { Metadata } from "next";
import NewArrivalProduct from "@/components/NewArrivalProduct";
export const metadata: Metadata = {
  title: "Al-Basher Shop - وصل حديثاً",
  keywords: [
    "وصل حديثاً",
    "منتجات جديدة",
    "تسوق عبر الإنترنت",
    "أجهزة iPhone",
    "اكسسوارات الهواتف",
    "ساعات آبل",
    "شواحن أصلية",
    "وصلات شحن",
    "ملحقات آيباد",
    "منتجات أصلية",
    "توصيل سريع",
    "أحدث المنتجات",
    "أجهزة إلكترونية جديدة",
    "أحدث الإكسسوارات",
    "أحدث الساعات الذكية",
    "أحدث الشواحن",
    "أحدث وصلات الشحن",
    "أحدث ملحقات آيباد",
    "أحدث سماعات بلوتوث",
    "أحدث بطاريات متنقلة",
    "أحدث حماية شاشة آيفون",
    "أحدث كفرات آيفون",
    "أحدث سماعات AirPods",
    "أحدث قلم آبل",
    "أحدث ملحقات أبل",
    "أحدث منتجات جيروم",
    "أحدث منتجات أنكر",
    "أحدث منتجات جوجل",
    "أحدث منتجات سامسونج",
    "أحدث منتجات سوني",
    "أحدث منتجات هواوي",
    "أحدث منتجات شاومي",
    "أحدث منتجات أوبو",
    "أحدث منتجات ون بلس",
    "أحدث منتجات ريلمي",
    "أحدث منتجات موتورولا",
    "أحدث منتجات إل جي",
    "أحدث منتجات نوكيا",
    "احدث منتجات ابل",
    "احدث منتجات آيفون",
    "احدث منتجات آيباد",
    "احدث منتجات آبل ووتش",
    "احدث منتجات ملحقات آيفون",
    "احدث منتجات ملحقات آيباد",
    "احدث منتجات ملحقات آبل ووتش",
    "احدث منتجات ملحقات آيباد",
    "احدث منتجات ملحقات آيفون",
    "احدث منتجات ملحقات آبل",
    "احدث منتجات ملحقات آيباد",

  ],

  description:
    "أفضل متجر في إربد لبيع أجهزة iPhone الأصلية، اكسسوارات الهواتف، ساعات آبل، شواحن أصلية، وصلات شحن، ملحقات آيباد، منتجات جيروم، أنكر، جوجل وغيرها من أفضل العلامات التجارية. تسوق الآن مع توصيل سريع وخدمة مميزة في الأردن.",

};

const NewArrivalProductPage = () => {
  return (
    <main>
      <NewArrivalProduct />
    </main>
  );
};

export default NewArrivalProductPage;
